## Pandas IO

In [2]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/ywchiu/taipeifubon/master/data/rent_591.csv', index_col=0)
#df

In [3]:
df.to_csv('rent_591.csv')

In [5]:
! head -n 3 rent_591.csv

,search_date,title,address,floor_info,price,layout,building_area,building_use
5,2018-05-12,近捷運，採光佳，有景觀，全新家電裝潢,新北市淡水區民族路,9F/11F,"22,000元/月",2房1廳1衛1陽臺,24.0,電梯大樓/整層住家
9,2018-05-14,大衛營優質社區管理好，交通便利、裝潢佳,基隆市安樂區樂利三街,14F/18F,"17,000元/月",2房1廳2衛2陽臺,32.0,電梯大樓/整層住家

In [6]:
df.to_csv('rent_591.tsv', sep='\t')

In [7]:
! head -n 3 rent_591.tsv

	search_date	title	address	floor_info	price	layout	building_area	building_use
5	2018-05-12	近捷運，採光佳，有景觀，全新家電裝潢	新北市淡水區民族路	9F/11F	22,000元/月	2房1廳1衛1陽臺	24.0	電梯大樓/整層住家
9	2018-05-14	大衛營優質社區管理好，交通便利、裝潢佳	基隆市安樂區樂利三街	14F/18F	17,000元/月	2房1廳2衛2陽臺	32.0	電梯大樓/整層住家

In [8]:
df.to_excel('rent_591.xlsx')

In [9]:
! open rent_591.xlsx

In [12]:
#df.T.to_json()

In [14]:
import pandas
df2 = pandas.read_clipboard()

In [16]:
#df2

In [17]:
import pandas
df2 = pandas.read_clipboard(header = None)

In [20]:
df2[0].value_counts()

電梯大樓/整層住家    8
電梯大樓/住辦      2
透天厝/整層住家     1
公寓/整層住家      1
透天厝/住辦       1
Name: 0, dtype: int64

In [21]:
import pandas
dfs = pandas.read_html('https://money.udn.com/money/breaknews/1001')

In [22]:
type(dfs)

list

In [23]:
len(dfs)

1

In [25]:
dfs[0].head()

                         標題  類別         出版時間  瀏覽數  分享數
0          台股開高走高 收漲552.75點  理財  03/20 13:54    0  NaN
1  武漢市中心醫院再傳人員離世 死者丈夫未染新冠肺炎  兩岸  03/20 13:54    2  NaN
2         六福客棧5月底熄燈 改建酒店式商辦  房產  03/20 13:54    1  NaN
3    水利會改制將上路 陳吉仲：百分百保障人事福利  產業  03/20 13:54    0  NaN
4    國安基金提振信心 台股報復性反彈大漲552點  產業  03/20 13:54    0  NaN

In [31]:
import pandas
dfs = pandas.read_html('https://www.cnyes.com/twstock/financial4.aspx')

In [33]:
#dfs[0]

In [35]:
import requests
res = requests.get('https://www.twse.com.tw/exchangeReport/MI_INDEX?response=json&date=20200320&type=MS&_=1584684261949')
jd = res.json()

In [37]:
pandas.DataFrame(jd['data7'])

             0                1              2          3
0       1.一般股票  202,530,887,260  4,686,206,000  1,598,919
1     2.台灣存託憑證       41,144,900     14,322,000      2,538
2       3.受益憑證                0              0          0
3        4.ETF   30,337,813,255  2,557,251,600    318,748
4       5.受益證券       12,301,360        888,000        165
5     6.變更交易股票       32,062,410      6,011,000        919
6    7.認購(售)權證    1,058,015,020    970,620,000     62,598
7      8.轉換公司債                0              0          0
8    9.附認股權特別股                0              0          0
9   10.附認股權公司債                0              0          0
10    11.認股權憑證                0              0          0
11      12.公司債                0              0          0
12      13.ETN       15,173,970      3,675,000        296
13   證券合計(1+6)  202,562,949,670  4,692,217,000  1,599,838
14    總計(1~13)  234,027,398,175  8,238,973,600  1,984,183

## SQLite

In [40]:
import sqlite3 as lite
con = lite.connect('test.sqlite')
cur = con.cursor()
cur.execute('SELECT SQLITE_VERSION()')
data = cur.fetchall()
print(data)
con.close()

[('3.24.0',)]

In [41]:
import sqlite3 as lite
with lite.connect('test.sqlite') as con:
    cur = con.cursor()
    cur.execute('SELECT SQLITE_VERSION()')
    data = cur.fetchall()
    print(data)

[('3.24.0',)]

In [42]:
import sqlite3 as lite 
with lite.connect("test.sqlite") as con: 
    cur = con.cursor() 
    cur.execute("DROP TABLE IF EXISTS PhoneAddress") 
    cur.execute("CREATE TABLE PhoneAddress(phone CHAR(10) PRIMARY KEY, address TEXT, name TEXT unique, age INT NOT NULL)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0912173381','United State','Jhon Doe',53)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0928375018','Tokyo Japan','MuMu Cat',6)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0957209108','Taipei','Richard',29)") 
    cur.execute("SELECT phone,address FROM PhoneAddress") 
    data = cur.fetchall() 
    for rec in data: 
        print(rec[0], rec[1])

0912173381 United State
0928375018 Tokyo Japan
0957209108 Taipei

In [43]:
import sqlite3 as lite 
with lite.connect("test.sqlite") as con: 
    cur = con.cursor() 
    cur.execute("DROP TABLE IF EXISTS PhoneAddress") 
    cur.execute("CREATE TABLE PhoneAddress(phone CHAR(10) PRIMARY KEY, address TEXT, name TEXT unique, age INT NOT NULL)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0912173381','United State','Jhon Doe',53)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0928375018','Tokyo Japan','MuMu Cat',6)") 
    cur.execute("INSERT INTO PhoneAddress VALUES('0957209108','Taipei','Richard',29)") 
    cur.execute("SELECT phone,address FROM PhoneAddress") 
    data = cur.fetchone()
    print(data)
    data = cur.fetchall() 
    for rec in data: 
        print(rec[0], rec[1])

('0912173381', 'United State')
0928375018 Tokyo Japan
0957209108 Taipei

In [44]:
import sqlite3 as lite
import pandas
employee = [{'name':'Mary', 'age':23 , 'gender': 'F'},{'name':'John', 'age':33 , 'gender': 'M'}]
df = pandas.DataFrame(employee)
df

   age gender  name
0   23      F  Mary
1   33      M  John

In [45]:
with lite.connect('test.sqlite') as db:
    df.to_sql(name='employee', 
              index=False, 
              con=db, 
              if_exists='replace')

In [48]:
with lite.connect('test.sqlite') as db:
    df2 = pandas.read_sql_query('select * from employee', con = db)
df2

   age gender  name
0   23      F  Mary
1   33      M  John

In [49]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/ywchiu/taipeifubon/master/data/rent_591.csv', index_col=0)
#df

In [50]:
len(df)

100

In [52]:
df['price'] = df['price'].map(lambda e: int(e.replace('元/月', '').replace(',','')))

In [54]:
df['search_date'] = pandas.to_datetime(df['search_date'], format = '%Y-%m-%d')

In [56]:
with lite.connect('house.sqlite') as db:
    df.to_sql(name='rent_591', 
              index=None, 
              con=db, 
              if_exists='replace')

In [62]:
with lite.connect('house.sqlite') as db:
    df2 = pandas.read_sql_query('select * from rent_591', con = db)
    df2 = pandas.read_sql_query('select * from rent_591 where price > 10000', con = db)
    df2 = pandas.read_sql_query('select address, price from rent_591 where price > 10000', con = db)
    df2 = pandas.read_sql_query('select address, price from rent_591 where price > 10000 order by price desc limit 3', con = db)
df2

        address  price
0     彰化縣大村鄉加錫巷  75000
1     台北市松山區北寧路  70000
2  台北市大安區敦化南路二段  58000

## 小任務 
現有一筆資料 purchase_order (https://raw.githubusercontent.com/ywchiu/tibamepy/master/data/purchase_order.tab)
欄位分別為：dt,type,userid,productid,quantity,price
1. 請幫我載入該資料到資料庫purchase.sqlite 下的 order 表格
2. 請幫我統計購買金額最大的前10 VIP 用戶